soluciones en el prestador/appliance/transacciones-ejemplos/pix.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:hl7-org:v2xml">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:HL7Msg>
         <!--Optional:-->
         <ADT_A01>
            <MSH>
               <MSH.1>|</MSH.1>
               <MSH.2>^~\&amp;</MSH.2>
               <MSH.3>
                  <HD.1>FNR</HD.1>
               </MSH.3>
               <MSH.4>
                  <HD.1>SALUDUY-TEST-UNO-FACILITY</HD.1>
               </MSH.4>
               <MSH.5>
                  <HD.1>FNR</HD.1>
               </MSH.5>
               <MSH.6>
                  <HD.1>FNR</HD.1>
               </MSH.6>
               <MSH.7>
                  <TS.1>201712061512</TS.1>
               </MSH.7>
               <MSH.9>
                  <MSG.1>ADT</MSG.1>
                  <MSG.2>A01</MSG.2>
                  <MSG.3>ADT_A04</MSG.3>
               </MSH.9>
               <MSH.10>2.16.858.2.10002007.72768.1.67430.20171206151253.435207</MSH.10>
               <MSH.11>
                  <PT.1>P</PT.1>
               </MSH.11>
               <MSH.12>
                  <VID.1>2.5</VID.1>
                  <VID.2/>
                  <VID.3/>
               </MSH.12>
               <MSH.19/>
               <MSH.21/>
            </MSH>
            <EVN>
               <EVN.2>
                  <TS.1>201712061512</TS.1>
               </EVN.2>
               <EVN.3/>
               <EVN.5>
                  <XCN.2/>
                  <XCN.9/>
                  <XCN.14/>
                  <XCN.16/>
                  <XCN.17>
                     <DR.1/>
                     <DR.2/>
                  </XCN.17>
                  <XCN.19/>
                  <XCN.20/>
                  <XCN.22/>
                  <XCN.23/>
               </EVN.5>
               <EVN.6/>
               <EVN.7/>
            </EVN>
            <PID>
               <PID.2>
                  <CX.4/>
                  <CX.6/>
                  <CX.9/>
                  <CX.10/>
               </PID.2>
               <PID.3>
                  <CX.1>107154</CX.1>
                  <CX.4>
                     <HD.1>SALUDUY-TEST-UNO-FACILITY</HD.1>
                     <HD.2>2.16.858.2.10000005.72768.3</HD.2>
                     <HD.3>ISO</HD.3>
                  </CX.4>
                  <CX.6/>
                  <CX.9/>
                  <CX.10/>
               </PID.3>

               <PID.3>
                  <CX.1>12345672</CX.1>
                  <CX.4>
                     <HD.1>CI</HD.1>
                     <HD.2>2.16.858.2.10000675.68909</HD.2>
                     <HD.3>ISO</HD.3>
                  </CX.4>
                  <CX.6/>
                  <CX.9/>
                  <CX.10/>
               </PID.3>
               <PID.4>
                  <CX.4/>
                  <CX.6/>
                  <CX.9/>
                  <CX.10/>
               </PID.4>
               <PID.5>
                  <XPN.1>
                     <FN.1>REGUEIRO</FN.1>
                  </XPN.1>
                  <XPN.2>ALVARO</XPN.2>
                  <XPN.3/>
                  <XPN.9/>
                  <XPN.10>
                     <DR.1/>
                     <DR.2/>
                  </XPN.10>
                  <XPN.12/>
                  <XPN.13/>
               </PID.5>
               <PID.6>
                  <XPN.1>
                     <FN.1>RIVAS</FN.1>
                  </XPN.1>
                  <XPN.9/>
                  <XPN.10>
                     <DR.1/>
                     <DR.2/>
                  </XPN.10>
                  <XPN.12/>
                  <XPN.13/>
               </PID.6>
               <PID.7>
                  <TS.1>19521217</TS.1>
               </PID.7>
               <PID.8>1</PID.8>
               <PID.9>
                  <XPN.1/>
                  <XPN.9/>
                  <XPN.10>
                     <DR.1/>
                     <DR.2/>
                  </XPN.10>
                  <XPN.12/>
                  <XPN.13/>
               </PID.9>
               <PID.10/>
               <PID.11>
                  <XAD.1/>
                  <XAD.4>MONTEVIDEO</XAD.4>
                  <XAD.6/>
                  <XAD.12>
                     <DR.1/>
                     <DR.2/>
                  </XAD.12>
                  <XAD.13/>
                  <XAD.14/>
               </PID.11>
               <PID.13>
                  <XTN.1/>
                  <XTN.2>NET</XTN.2>
                  <XTN.3/>
                  <XTN.4>correo2@gmail.com</XTN.4>
               </PID.13>
               <PID.13>
                  <XTN.1/>
               </PID.13>
               <PID.14/>
               <PID.15/>
               <PID.16/>
               <PID.17/>
               <PID.18>
                  <CX.4/>
                  <CX.6/>
                  <CX.9/>
                  <CX.10/>
               </PID.18>
               <PID.20/>
               <PID.21>
                  <CX.4/>
                  <CX.6/>
                  <CX.9/>
                  <CX.10/>
               </PID.21>
               <PID.22/>
               <PID.26/>
               <PID.27/>
               <PID.28/>
               <PID.29/>
            </PID>
            <PV1>
               <PV1.1>U</PV1.1>
            </PV1>
         </ADT_A01>
      </urn:HL7Msg>
   </soapenv:Body>
</soapenv:Envelope>